Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/TBM_СценарииБотовTelegram/TBM_СценарииБотовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TBM_СценарииБотовTelegram</name>
  <attributes>
    <name>ТипСценария</name>
    <type>
      <types>EnumRef.TBM_ТипыСценариевБотовTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отчеты</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>НаименованиеЭтапа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КнопкиКлавиатуры</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапросНомераТелефона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/InformationRegisters/TBM_ОдноразовыеПаролиАвторизацииЧатовTelegram/TBM_ОдноразовыеПаролиАвторизацииЧатовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TBM_ОдноразовыеПаролиАвторизацииЧатовTelegram</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.TBM_СценарииБотовTelegram</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/InformationRegisters/TBM_АвторизованныеСценарииЧатовTelegram/TBM_АвторизованныеСценарииЧатовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TBM_АвторизованныеСценарииЧатовTelegram</name>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.TBM_БотыTelegram</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Чат</name>
    <type>
      <types>CatalogRef.TBM_ЧатыTelegram</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.TBM_СценарииБотовTelegram</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Enums/TBM_ТипыСценариевБотовTelegram/TBM_ТипыСценариевБотовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TBM_ТипыСценариевБотовTelegram</name>
  <enumValues>
    <name>ОтправкаОтчета</name>
  </enumValues>
  <enumValues>
    <name>Общение</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйСценарий</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/TBM_ОбщенияБотовTelegramСЧатами/TBM_ОбщенияБотовTelegramСЧатами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TBM_ОбщенияБотовTelegramСЧатами</name>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.TBM_БотыTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>Чат</name>
    <type>
      <types>CatalogRef.TBM_ЧатыTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.TBM_СценарииБотовTelegram</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеЗначений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>НаименованиеЭтапа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Завершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/TBM_СценарииБотовTelegram/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает или обновляет псевдо-предопределенный сценарий авторизации чатов.
Процедура ИнициализироватьСценарийАвторизации() Экспорт

	Если ЗначениеЗаполнено(СценарийАвторизацииЧатов()) Тогда
		Возврат;
	КонецЕсли;

	СценарийАвторизации = СоздатьЭлемент();

	СценарийАвторизации.Наименование = "Authorization";
	СценарийАвторизации.ТипСценария = Перечисления.TBM_ТипыСценариевБотовTelegram.Общение;

	ЭтапОтказа = СценарийАвторизации.Этапы.Добавить();
	ЭтапОтказа.НаименованиеЭтапа = "Отказ в доступе";
	ЭтапОтказа.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапОтказа.ПроизвольныйКод = "Результат.Ответ = ""Для продолжения необходимо авторизоваться. 
								 ||
								 ||Выберите один из вариантов авторизации: 
								 ||
								 || - OTP: введите одноразовый пароль, сгенерированный на стороне учетной системы 
								 ||
								 || - Номер телефона: отправьте свой номер телефона и дождитесь подтверждения со стороны администратора"";
								 |
								 |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);";

	КнопкаОтправитьНомерТелефона = СценарийАвторизации.КнопкиКлавиатуры.Добавить();
	КнопкаОтправитьНомерТелефона.Наименование = "Отправить номер телефона";
	КнопкаОтправитьНомерТелефона.УникальныйИдентификатор = ЭтапОтказа.УникальныйИдентификатор;
	КнопкаОтправитьНомерТелефона.ЗапросНомераТелефона = Истина;

	КнопкаОтправитьНомерТелефона = СценарийАвторизации.КнопкиКлавиатуры.Добавить();
	КнопкаОтправитьНомерТелефона.Наименование = "Ввести одноразовый код (OTP)";
	КнопкаОтправитьНомерТелефона.УникальныйИдентификатор = ЭтапОтказа.УникальныйИдентификатор;

	ЭтапПроверки = СценарийАвторизации.Этапы.Добавить();
	ЭтапПроверки.НаименованиеЭтапа = "Проверка OTP / Сохранение номера телефона";
	ЭтапПроверки.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапПроверки.ПроизвольныйКод = "Параметры.КнопкиКлавиатуры.Очистить();
								   |
								   |Если Параметры.ТекстСообщения = ""Ввести одноразовый код (OTP)"" Тогда
								   |
								   |Результат.Ответ = ""Введите одноразовый код (OTP)"";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |
								   |ИначеЕсли ЗначениеЗаполнено(Параметры.Контакт.НомерТелефона) Тогда
								   |
								   |ОбъектЧата = Чат.ПолучитьОбъект();
								   |ОбъектЧата.ИмяКонтакта = Параметры.Контакт.Имя;
								   |ОбъектЧата.НомерТелефона = Параметры.Контакт.НомерТелефона;
								   |ОбъектЧата.Записать();
								   |
								   |Результат.Ответ = ""Спасибо! Ваш запрос на авторизацию будет рассмотрен со стороны администратора."";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |ЗавершитьЭтап(""Ввод OTP"");
								   |
								   |Иначе
								   |
								   |КнопкаКлавиатуры = Справочники.TBM_ОбщенияБотовTelegramСЧатами.НоваяСтруктураКнопкаКлавиатуры();
								   |КнопкаКлавиатуры.Наименование = ""Отправить номер телефона"";
								   |КнопкаКлавиатуры.ЗапросНомераТелефона = Истина;
								   |Параметры.КнопкиКлавиатуры.Добавить(КнопкаКлавиатуры);
								   |
								   |КнопкаКлавиатуры = Справочники.TBM_ОбщенияБотовTelegramСЧатами.НоваяСтруктураКнопкаКлавиатуры();
								   |КнопкаКлавиатуры.Наименование = ""Ввести одноразовый код (OTP)"";
								   |Параметры.КнопкиКлавиатуры.Добавить(КнопкаКлавиатуры);
								   |
								   |Результат.Ответ = ""Пожалуйста, выебрите один из доступных вариантов авторизации."";
								   |
								   |КонецЕсли;";

	ЭтапВводаOTP = СценарийАвторизации.Этапы.Добавить();
	ЭтапВводаOTP.НаименованиеЭтапа = "Ввод OTP";
	ЭтапВводаOTP.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапВводаOTP.ПроизвольныйКод = "ДанныеПароля = РегистрыСведений.TBM_ОдноразовыеПаролиАвторизацииЧатовTelegram.ОдноразовыйПарольАвторизацииЧата(ЗапрошенныйСценарий);
								   |
								   |Пароль = ДанныеПароля.Пароль;
								   |
								   |Если Параметры.ТекстСообщения = Пароль Тогда
								   |
								   |
								   |Запись = РегистрыСведений.TBM_АвторизованныеСценарииЧатовTelegram.СоздатьМенеджерЗаписи();
								   |Запись.Бот = Бот;
								   |Запись.Чат = Чат;
								   |Запись.Сценарий = ЗапрошенныйСценарий;
								   |Запись.Записать();
								   |
								   |Результат.Ответ = ""Авторизация успешно завершена. Вы можете продолжить работу с ботом"";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |
								   |Иначе
								   |
								   |Результат.Ответ = ""Неверный код"";
								   |
								   |КонецЕсли;";

	СценарийАвторизации.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СценарийАвторизацииЧатов() Экспорт

	Возврат НайтиПоНаименованию("Authorization");

КонецФункции

#КонецОбласти

#КонецЕсли
